线程相关： 锁(sync和Lock) 、线程池 、异步计算、
一些相关概念： 重入锁 、轻量级锁 、重量级锁、 KClass对象头、 悲观锁 、乐观锁、
AQS原理和相关实现(并发集合/Lock)
NIO相关(通信方面一定要了解[IO/NIO/AIO]) ：NIO模型 、NIO选择器、 xxxx 高并发的解决方案、
数据静态化 、缓存、 数据库集群 、负载均衡 、CDN加速、 设计模式和设计原则 、工厂模式、 代理模式 、组合模式、 开闭原则、

相关的分布式框架以及中间件 分布式任务调度框架 消息中间件(各种MQ) 分布式通信 常见的分布式框架 数据结构以及算法相关 没啥好说的，看看JCF就能应付一般的 基本的排序算法(冒泡，快排，归并) 二分查找/Top10/and so on 树的性质和相关操作 Spring相关

---

《数据结构和算法》：基础的知识

《深入java虚拟机》：同上。

《Java并发编程的艺术》：这本书对并发编程的常用知识点进行了系统的讲解，将的深度还可以，没有具体的案例。

《架构探险》：同上，这本书上对于我们理解Spring中的实现原理，还是有一定的帮助的。书中模仿Spring框架，写的
配置文件加载、类加载器、IOC的实现、AOP的实现还是有参考价值的。

《Redis实战》：现在用的越来越多了，不管用没用过，都可以学习一下。

《大型分布式网站架构设计与实践》：这本书从总体上讲解了大型网站架构常用的技术，不深入，对于从整体上认识
大型分布式网站还是很有参考价值的。如果我们想要在哪一方面深入学习，可以有针对性的进行深入学习。

《大型网站技术架构：核心原理与案例分析》：同上。

《Java程序员面试笔试宝典》：买这本书主要是找工作时，做一些题目，对于笔试来说，有针对性的学习复习一下。



---

